# Chapter 6. Operations with strings.
# Practice 2. Indexes.

print(
"""Строки, так же как списки и кортежи, итерируемы. Доступ к каждому символу в
строке производится при помощи индекса. Как и у остальных итерируемых объ-
ектов, первый символ в строке имеет индекс 0, каждый последующий индекс
увеличивается на 1.
Ниже приведен пример:
""")
# Вывод описания кода программы
print(
"""Код программы:
author = "Кафка"
author[0]
author[1]
author[2]
author[3]
author[4]
""")
# Код программы
author = "Кафка"
# Вывод результата
print("Результат:")
print(author[0])
print(author[1])
print(author[2])
print(author[3])
print(author[4])
