# Chapter 6. Practice challenge 1.
# Выведите каждый символ в строке «Чехов».

print("""
Выведите каждый символ в строке «Чехов».
""")

a = "Чехов"
print("Результат:")
print(a[0])
print(a[1])
print(a[2])
print(a[3])
print(a[4])
