# Chapter 6. Operations with strings.
# Practice 2. Register Change. 

# Метод upper()
print(
"""
При помощи вызова метода upper можно превратить каждую букву в строке в
прописную.Ниже приведен пример:

Код:
"Я хочу спать".upper()
Результат:""")

print("Я хочу спать".upper())

# Метод lower()
print(
"""
Аналогично каждую букву в строке можно сделать строчной, вызвав в этой
строке метод lower.Ниже приведен пример:

Код:
"Я ХОЧУ СПАТЬ".lower()
Результат:""")

print("Я ХОЧУ СПАТЬ".lower())

# Метод capiyalize()
print(
"""
Первую букву предложения можно сделать прописной, вызвав метод
capitalize.Ниже приведен пример:

Код:
"спать".capitalize()
Результат:""")

print("спать".capitalize())
