# Chapter 6. Operations with strings.
# Practice 8. Key word -in- and -not in-. 

print("""
Ключевое слово in проверяет, содержится ли строка в другой строке, и возвра-
щает значение True или False.
""")
# Пример 1
print("""Пример 1:

"Кот" in "Кот в шляпе"
""")
print("Результат:")
print("Кот" in "Кот в шляпе")
 
# Пример 2
print("""
Пример 2:

"Мышь" in "Кот в шляпе"
""")
print("Результат:")
print("Мышь" in "Кот в шляпе") 

# Пример 2
print("""
Пример 3:
Поместите ключевое слово not перед in, чтобы проверить отсутствие стро-
ки в другой строке.

"Мышь" not in "Кот в шляпе"
""")
print("Результат:")
print("Мышь" not in "Кот в шляпе") 
