# Chapter 6. Operations with strings.
# Practice 2. Indexes 2. Using negative index

print(
"""Как и кортежи, строки неизменяемы. Нельзя изменять символы в строке – если
вы хотите это сделать, нужно создавать новую строку.
Ниже приведен пример:
""")
# Вывод описания кода программы
print(
"""Код программы:
author = "Ф. Фицджеральд"
author = "Ф. Скотт Фицджеральд"
author
""")
# Код программы
author = "Ф. Фицджеральд"
author = "Ф. Скотт Фицджеральд"
# Вывод результата
print("Результат:")
print(author)
