# Chapter 6. Operations with strings.
# Practice 4. Join Method. 

print("""
Использование метода join!
Метод join позволяет добавлять новые символы между всеми символами в строке.
""")
# Пример 1
print("""Пример 1:
first_three = "абв"
result = "+".join(first_three)
result
""")
first_three = "абв"
result = "+".join(first_three)
print("Результат:")
print(result)

# Пример 2
print("""
Пример 2:
Превратить список строк в единую строку можно, вызвав метод join в пу-
стой строке и передав этот список в качестве параметра метода.

words = ["Рыжая","лисица","сделала","кувырок","через","голову","."]
one = "".join(words)
one
""")
words = ["Рыжая","лисица","сделала","кувырок","через","голову","."]
one = "".join(words)
print("Результат:")
print(one)

# Пример 3
print("""
Пример 3:
Если вызвать метод join в строке, содержащей лишь пробел, можно создать
новую строку, в которой каждое слово отделено пробелом.

words = ["Рыжая","лисица","сделала","кувырок","через","голову","."]
one = " ".join(words)
one
""")
words = ["Рыжая","лисица","сделала","кувырок","через","голову","."]
one = " ".join(words)
print("Результат:")
print(one)
