# Практика по встроенным функциям

# Функция print - выводит заданные в скобках значения (объекты) 

print ("Заданные значения")


# Функция len - возвращает длинну объекта, например строки (т.е. кол-во символов в ней)

len ("Заданные значения")
print (len ("Заданные значения"))


# Функция str - принимает объект и возвращает новый объект с типом данных str.
# Например, функцию str можно исполльзовать для преобразования целого числа в строку.

str (100)
print (str (100))


# Функция int принимает объект и возвращает его в виде целого числа.

int ("1")
int (1.5)
print (int ("1"))
print (int (1.5))

# Функция float принимает объект и возвращает число с плавающей точкой.

float (100)
float ("100.66")
print (float (100))
print (float ("100.66"))
