# Chapter 5. Practice challenge 1. 
"""Создайте словарь, содержащий различные данные о вас:
имя, отчество, фамилия, пол, день рождения, рост, вес, место рождения, место проживания..."""

print("Краткая информация обо мне")
me_inf = dict()
#0 Имя
me_inf["Имя"] = "Михаил"
#1 Отчество
me_inf["Отчество"] = "Юрьевич"
#2 Фамилия
me_inf["Фамилия"] = "Заберов"
#3 Пол
me_inf["Пол"] = "Мужской"
#4 День рождения
me_inf["День рождения"] = "18 ноября 1981 года"
#5 Место рождения 
me_inf["Место рождения"] = "г. Чайковский, Пермской обл."
#6 Место проживания 
me_inf["Место проживания"] = "Москва, город Зеленоград"
#7 Рост 
me_inf["Рост"] = "175 см"
#8 Вес 
me_inf["Вес"] = "81 кг"

print(me_inf)
